<table class="forms-table">
 <tr>
  <th>м.р., ед.ч.</th>
  <td>{м.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>м.р., ед.ч., непълен член</th>
  <td>{м.р., ед.ч., непълен член}</td>
 </tr>
 <tr>
  <th>м.р., ед.ч., пълен член</th>
  <td>{м.р., ед.ч., пълен член}</td>
 </tr>
 <tr>
  <th>ж.р., ед.ч.</th>
  <td>{ж.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>ж.р., ед.ч., членувано</th>
  <td>{ж.р., ед.ч., членувано}</td>
 </tr>
 <tr>
  <th>ср.р., ед.ч.</th>
  <td>{ср.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>ср.р., ед.ч., членувано</th>
  <td>{ср.р., ед.ч., членувано}</td>
 </tr>
 <tr>
  <th>мн.ч.</th>
  <td>{мн.ч.}</td>
 </tr>
 <tr>
  <th>мн.ч., членувано</th>
  <td>{мн.ч., членувано}</td>
 </tr>
 <tr>
  <th>кратка форма</th>
  <td>{кратка форма}</td>
 </tr>
</table>
