<h4>Лични глаголни форми</h4>

<h5>Изявително наклонение</h5>

<h6 id="segashno">Сегашно време</h6>
<table class="forms-table">
 <tr>
  <th></th>
  <th>единствено число</th>
  <th>множествено число</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{сег.вр., 1л., ед.ч.}</td>
  <td>{сег.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{сег.вр., 2л., ед.ч.}</td>
  <td>{сег.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{сег.вр., 3л., ед.ч.}</td>
  <td>{сег.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="minalo-svarsheno">Минало свършено време (аорист)</h6>
<table class="forms-table">
 <tr>
  <th></th>
  <th>единствено число</th>
  <th>множествено число</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{мин.св.вр., 1л., ед.ч.}</td>
  <td>{мин.св.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{мин.св.вр., 2л., ед.ч.}</td>
  <td>{мин.св.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{мин.св.вр., 3л., ед.ч.}</td>
  <td>{мин.св.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="minalo-nesvarsheno">Минало несвършено време (имперфект)</h6>
<table class="forms-table">
 <tr>
  <th></th>
  <th>единствено число</th>
  <th>множествено число</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{мин.несв.вр., 1л., ед.ч.}</td>
  <td>{мин.несв.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{мин.несв.вр., 2л., ед.ч.}</td>
  <td>{мин.несв.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{мин.несв.вр., 3л., ед.ч.}</td>
  <td>{мин.несв.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="minalo-neopredeleno">Минало неопределено време (перфект)</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{мин.неопр.вр., 1л., ед.ч., м.р.}</td>
  <td>{мин.неопр.вр., 1л., ед.ч., ж.р.}</td>
  <td>{мин.неопр.вр., 1л., ед.ч., ср.р.}</td>
  <td>{мин.неопр.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{мин.неопр.вр., 2л., ед.ч., м.р.}</td>
  <td>{мин.неопр.вр., 2л., ед.ч., ж.р.}</td>
  <td>{мин.неопр.вр., 2л., ед.ч., ср.р.}</td>
  <td>{мин.неопр.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{мин.неопр.вр., 3л., ед.ч., м.р.}</td>
  <td>{мин.неопр.вр., 3л., ед.ч., ж.р.}</td>
  <td>{мин.неопр.вр., 3л., ед.ч., ср.р.}</td>
  <td>{мин.неопр.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="minalo-predvaritelno">Минало предварително време (плусквамперфект)</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{мин.пред.вр., 1л., ед.ч., м.р.}</td>
  <td>{мин.пред.вр., 1л., ед.ч., ж.р.}</td>
  <td>{мин.пред.вр., 1л., ед.ч., ср.р.}</td>
  <td>{мин.пред.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{мин.пред.вр., 2л., ед.ч., м.р.}</td>
  <td>{мин.пред.вр., 2л., ед.ч., ж.р.}</td>
  <td>{мин.пред.вр., 2л., ед.ч., ср.р.}</td>
  <td>{мин.пред.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{мин.пред.вр., 3л., ед.ч., м.р.}</td>
  <td>{мин.пред.вр., 3л., ед.ч., ж.р.}</td>
  <td>{мин.пред.вр., 3л., ед.ч., ср.р.}</td>
  <td>{мин.пред.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="badeshte">Бъдеще време</h6>
<table class="forms-table">
 <tr>
  <th></th>
  <th>единствено число</th>
  <th>множествено число</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{бъд.вр., 1л., ед.ч.}</td>
  <td>{бъд.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{бъд.вр., 2л., ед.ч.}</td>
  <td>{бъд.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{бъд.вр., 3л., ед.ч.}</td>
  <td>{бъд.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="badeshte-predvaritelno">Бъдеще предварително време</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{бъд.пред.вр., 1л., ед.ч., м.р.}</td>
  <td>{бъд.пред.вр., 1л., ед.ч., ж.р.}</td>
  <td>{бъд.пред.вр., 1л., ед.ч., ср.р.}</td>
  <td>{бъд.пред.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{бъд.пред.вр., 2л., ед.ч., м.р.}</td>
  <td>{бъд.пред.вр., 2л., ед.ч., ж.р.}</td>
  <td>{бъд.пред.вр., 2л., ед.ч., ср.р.}</td>
  <td>{бъд.пред.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{бъд.пред.вр., 3л., ед.ч., м.р.}</td>
  <td>{бъд.пред.вр., 3л., ед.ч., ж.р.}</td>
  <td>{бъд.пред.вр., 3л., ед.ч., ср.р.}</td>
  <td>{бъд.пред.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="badeshte-minalo">Бъдеще време в миналото</h6>
<table class="forms-table">
 <tr>
  <th></th>
  <th>единствено число</th>
  <th>множествено число</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{бъд.вр. в мин., 1л., ед.ч.}</td>
  <td>{бъд.вр. в мин., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{бъд.вр. в мин., 2л., ед.ч.}</td>
  <td>{бъд.вр. в мин., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{бъд.вр. в мин., 3л., ед.ч.}</td>
  <td>{бъд.вр. в мин., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="badeshte-predvaritelno-minalo">Бъдеще предварително време в миналото</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{бъд.пред.вр. в мин., 1л., ед.ч., м.р.}</td>
  <td>{бъд.пред.вр. в мин., 1л., ед.ч., ж.р.}</td>
  <td>{бъд.пред.вр. в мин., 1л., ед.ч., ср.р.}</td>
  <td>{бъд.пред.вр. в мин., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{бъд.пред.вр. в мин., 2л., ед.ч., м.р.}</td>
  <td>{бъд.пред.вр. в мин., 2л., ед.ч., ж.р.}</td>
  <td>{бъд.пред.вр. в мин., 2л., ед.ч., ср.р.}</td>
  <td>{бъд.пред.вр. в мин., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{бъд.пред.вр. в мин., 3л., ед.ч., м.р.}</td>
  <td>{бъд.пред.вр. в мин., 3л., ед.ч., ж.р.}</td>
  <td>{бъд.пред.вр. в мин., 3л., ед.ч., ср.р.}</td>
  <td>{бъд.пред.вр. в мин., 3л., мн.ч.}</td>
 </tr>
</table>

<h5>Преизказно наклонение</h5>

<h6 id="segashno-preizkazno">
 Сегашно време в преизказно наклонение<br>
 Минало несвършено време в преизказно наклонение (имперфект)
</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{пр.накл., сег.вр., 1л., ед.ч., м.р.}</td>
  <td>{пр.накл., сег.вр., 1л., ед.ч., ж.р.}</td>
  <td>{пр.накл., сег.вр., 1л., ед.ч., ср.р.}</td>
  <td>{пр.накл., сег.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{пр.накл., сег.вр., 2л., ед.ч., м.р.}</td>
  <td>{пр.накл., сег.вр., 2л., ед.ч., ж.р.}</td>
  <td>{пр.накл., сег.вр., 2л., ед.ч., ср.р.}</td>
  <td>{пр.накл., сег.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{пр.накл., сег.вр., 3л., ед.ч., м.р.}</td>
  <td>{пр.накл., сег.вр., 3л., ед.ч., ж.р.}</td>
  <td>{пр.накл., сег.вр., 3л., ед.ч., ср.р.}</td>
  <td>{пр.накл., сег.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="minalo-svarsheno-preizkazno">Минало свършено време в преизказно наклонение (аорист)</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{пр.накл., мин.св.вр., 1л., ед.ч., м.р.}</td>
  <td>{пр.накл., мин.св.вр., 1л., ед.ч., ж.р.}</td>
  <td>{пр.накл., мин.св.вр., 1л., ед.ч., ср.р.}</td>
  <td>{пр.накл., мин.св.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{пр.накл., мин.св.вр., 2л., ед.ч., м.р.}</td>
  <td>{пр.накл., мин.св.вр., 2л., ед.ч., ж.р.}</td>
  <td>{пр.накл., мин.св.вр., 2л., ед.ч., ср.р.}</td>
  <td>{пр.накл., мин.св.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{пр.накл., мин.св.вр., 3л., ед.ч., м.р.}</td>
  <td>{пр.накл., мин.св.вр., 3л., ед.ч., ж.р.}</td>
  <td>{пр.накл., мин.св.вр., 3л., ед.ч., ср.р.}</td>
  <td>{пр.накл., мин.св.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="minalo-neopredeleno-preizkazno">
 Минало неопределено време в преизказно наклонение (перфект)<br>
 Минало предварително време в преизказно наклонение (плусквамперфект)
</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{пр.накл., мин.неопр.вр., 1л., ед.ч., м.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 1л., ед.ч., ж.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 1л., ед.ч., ср.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{пр.накл., мин.неопр.вр., 2л., ед.ч., м.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 2л., ед.ч., ж.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 2л., ед.ч., ср.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{пр.накл., мин.неопр.вр., 3л., ед.ч., м.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 3л., ед.ч., ж.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 3л., ед.ч., ср.р.}</td>
  <td>{пр.накл., мин.неопр.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="badeshte-preizkazno">
 Бъдеще време в преизказно наклонение<br>
 Бъдеще време в миналото в преизказно наклонение
</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{пр.накл., бъд.вр., 1л., ед.ч., м.р.}</td>
  <td>{пр.накл., бъд.вр., 1л., ед.ч., ж.р.}</td>
  <td>{пр.накл., бъд.вр., 1л., ед.ч., ср.р.}</td>
  <td>{пр.накл., бъд.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{пр.накл., бъд.вр., 2л., ед.ч., м.р.}</td>
  <td>{пр.накл., бъд.вр., 2л., ед.ч., ж.р.}</td>
  <td>{пр.накл., бъд.вр., 2л., ед.ч., ср.р.}</td>
  <td>{пр.накл., бъд.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{пр.накл., бъд.вр., 3л., ед.ч., м.р.}</td>
  <td>{пр.накл., бъд.вр., 3л., ед.ч., ж.р.}</td>
  <td>{пр.накл., бъд.вр., 3л., ед.ч., ср.р.}</td>
  <td>{пр.накл., бъд.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h6 id="badeshte-predvaritelno-preizkazno">
 Бъдеще предварително време в преизказно наклонение<br>
 Бъдеще предварително време в миналото в преизказно наклонение
</h6>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{пр.накл., бъд.пред.вр., 1л., ед.ч., м.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 1л., ед.ч., ж.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 1л., ед.ч., ср.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{пр.накл., бъд.пред.вр., 2л., ед.ч., м.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 2л., ед.ч., ж.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 2л., ед.ч., ср.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{пр.накл., бъд.пред.вр., 3л., ед.ч., м.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 3л., ед.ч., ж.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 3л., ед.ч., ср.р.}</td>
  <td>{пр.накл., бъд.пред.вр., 3л., мн.ч.}</td>
 </tr>
</table>

<h5 id="uslovno">Условно наклонение</h5>
<table class="forms-table">
 <tr>
  <th rowspan="2"></th>
  <th colspan="3">единствено число</th>
  <th rowspan="2">множествено число</th>
 </tr>
 <tr>
  <th>мъжки род</th>
  <th>женски род</th>
  <th>среден род</th>
 </tr>
 <tr>
  <th>1 лице</th>
  <td>{условно наклонение, 1л., ед.ч., м.р.}</td>
  <td>{условно наклонение, 1л., ед.ч., ж.р.}</td>
  <td>{условно наклонение, 1л., ед.ч., ср.р.}</td>
  <td>{условно наклонение, 1л., мн.ч.}</td>
 </tr>
 <tr>
  <th>2 лице</th>
  <td>{условно наклонение, 2л., ед.ч., м.р.}</td>
  <td>{условно наклонение, 2л., ед.ч., ж.р.}</td>
  <td>{условно наклонение, 2л., ед.ч., ср.р.}</td>
  <td>{условно наклонение, 2л., мн.ч.}</td>
 </tr>
 <tr>
  <th>3 лице</th>
  <td>{условно наклонение, 3л., ед.ч., м.р.}</td>
  <td>{условно наклонение, 3л., ед.ч., ж.р.}</td>
  <td>{условно наклонение, 3л., ед.ч., ср.р.}</td>
  <td>{условно наклонение, 3л., мн.ч.}</td>
 </tr>
</table>

<h5 id="povelitelno">Повелително наклонение</h5>
<table class="forms-table">
 <tr>
  <th>единствено число</th>
  <th>множествено число</th>
 </tr>
 <tr>
  <td>{повелително наклонение, ед.ч.}</td>
  <td>{повелително наклонение, мн.ч.}</td>
 </tr>
</table>

<h4>Причастия (отглаголни прилагателни)</h4>

<h5 id="minalo-stradatelno">Минало страдателно причастие</h5>
<table class="forms-table">
 <tr>
  <th rowspan="7">единствено число</th>
  <th rowspan="3">мъжки род</th>
  <th></th>
  <td>{мин.страд.прич. м.р.}</td>
 </tr>
 <tr>
  <th>непълен член</th>
  <td>{мин.страд.прич. м.р. непълен член}</td>
 </tr>
 <tr>
  <th>пълен член</th>
  <td>{мин.страд.прич. м.р. пълен член}</td>
 </tr>
 <tr>
  <th rowspan="2">женски род</th>
  <th></th>
  <td>{мин.страд.прич. ж.р.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{мин.страд.прич. ж.р. членувано}</td>
 </tr>
 <tr>
  <th rowspan="2">среден род</th>
  <th></th>
  <td>{мин.страд.прич. ср.р.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{мин.страд.прич. ср.р. членувано}</td>
 </tr>
 <tr>
  <th rowspan="2" colspan="2">множествено число</th>
  <th></th>
  <td>{мин.страд.прич. мн.ч.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{мин.страд.прич. мн.ч. членувано}</td>
 </tr>
</table>

<h5 id="minalo-svarsheno-dejatelno">Минало свършено деятелно причастие</h5>
<table class="forms-table">
 <tr>
  <th rowspan="7">единствено число</th>
  <th rowspan="3">мъжки род</th>
  <th></th>
  <td>{мин.деят.св.прич. м.р.}</td>
 </tr>
 <tr>
  <th>непълен член</th>
  <td>{мин.деят.св.прич. м.р. непълен член}</td>
 </tr>
 <tr>
  <th>пълен член</th>
  <td>{мин.деят.св.прич. м.р. пълен член}</td>
 </tr>
 <tr>
  <th rowspan="2">женски род</th>
  <th></th>
  <td>{мин.деят.св.прич. ж.р.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{мин.деят.св.прич. ж.р. членувано}</td>
 </tr>
 <tr>
  <th rowspan="2">среден род</th>
  <th></th>
  <td>{мин.деят.св.прич. ср.р.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{мин.деят.св.прич. ср.р. членувано}</td>
 </tr>
 <tr>
  <th rowspan="2" colspan="2">множествено число</th>
  <th></th>
  <td>{мин.деят.св.прич. мн.ч.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{мин.деят.св.прич. мн.ч. членувано}</td>
 </tr>
</table>

<h5 id="minalo-nesvarsheno-dejatelno">Минало несвършено деятелно причастие</h5>
<table class="forms-table">
 <tr>
  <th rowspan="3">единствено число</th>
  <th>мъжки род</th>
  <td>{мин.деят.несв.прич. м.р.}</td>
 </tr>
 <tr>
  <th>женски род</th>
  <td>{мин.деят.несв.прич. ж.р.}</td>
 </tr>
 <tr>
  <th>среден род</th>
  <td>{мин.деят.несв.прич. ср.р.}</td>
 </tr>
 <tr>
  <th colspan="2">множествено число</th>
  <td>{мин.деят.несв.прич. мн.ч.}</td>
 </tr>
</table>

<h5 id="segashno-dejatelno">Сегашно деятелно причастие</h5>
<table class="forms-table">
 <tr>
  <th rowspan="7">единствено число</th>
  <th rowspan="3">мъжки род</th>
  <th></th>
  <td>{сег.деят.прич. м.р.}</td>
 </tr>
 <tr>
  <th>непълен член</th>
  <td>{сег.деят.прич. м.р. непълен член}</td>
 </tr>
 <tr>
  <th>пълен член</th>
  <td>{сег.деят.прич. м.р. пълен член}</td>
 </tr>
 <tr>
  <th rowspan="2">женски род</th>
  <th></th>
  <td>{сег.деят.прич. ж.р.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{сег.деят.прич. ж.р. членувано}</td>
 </tr>
 <tr>
  <th rowspan="2">среден род</th>
  <th></th>
  <td>{сег.деят.прич. ср.р.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{сег.деят.прич. ср.р. членувано}</td>
 </tr>
 <tr>
  <th rowspan="2" colspan="2">множествено число</th>
  <th></th>
  <td>{сег.деят.прич. мн.ч.}</td>
 </tr>
 <tr>
  <th>членувано</th>
  <td>{сег.деят.прич. мн.ч. членувано}</td>
 </tr>
</table>

<h4 id="deeprichastie">Деепричастие (отглаголно наречие)</h4>
<p>{деепричастие}</p>
