<table class="forms-table">
 <tr>
  <th>м.р., ед.ч.</th>
  <td>{м.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>м.р., ед.ч., непълен член</th>
  <td>{м.р., ед.ч., непълен член}</td>
 </tr>
 <tr>
  <th>м.р., ед.ч., пълен член</th>
  <td>{м.р., ед.ч., пълен член}</td>
 </tr>
 <tr>
  <th>ж.р., ед.ч.</th>
  <td>{ж.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>ж.р., ед.ч., членувано</th>
  <td>{ж.р., ед.ч., членувано}</td>
 </tr>
 <tr>
  <th>ср.р., ед.ч.</th>
  <td>{ср.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>ср.р., ед.ч., членувано</th>
  <td>{ср.р., ед.ч., членувано}</td>
 </tr>
 <tr>
  <th>мн.ч.</th>
  <td>{мн.ч.}</td>
 </tr>
 <tr>
  <th>мн.ч., членувано</th>
  <td>{мн.ч., членувано}</td>
 </tr>
 <tr>
  <th>бройна форма</th>
  <td>{бройна форма}</td>
 </tr>
 <tr>
  <th>м.р., мн.ч.</th>
  <td>{м.р., мн.ч.}</td>
 </tr>
 <tr>
  <th>м.р., мн.ч., членувано</th>
  <td>{м.р., мн.ч., членувано}</td>
 </tr>
 <tr>
  <th>ж.р., мн.ч.</th>
  <td>{ж.р., мн.ч.}</td>
 </tr>
 <tr>
  <th>ж.р., мн.ч., членувано</th>
  <td>{ж.р., мн.ч., членувано}</td>
 </tr>
 <tr>
  <th>ср.р., мн.ч.</th>
  <td>{ср.р., мн.ч.}</td>
 </tr>
 <tr>
  <th>ср.р., мн.ч., членувано</th>
  <td>{ср.р., мн.ч., членувано}</td>
 </tr>
 <tr>
  <th>мъжколична форма</th>
  <td>{мъжколична форма}</td>
 </tr>
 <tr>
  <th>мъжколична форма, членувано</th>
  <td>{мъжколична форма, членувано}</td>
 </tr>
 <tr>
  <th>приблизителен брой</th>
  <td>{приблизителен брой}</td>
 </tr>
 <tr>
  <th>приблизителен брой, членувано</th>
  <td>{приблизителен брой, членувано}</td>
 </tr>
</table>
