<table class="forms-table">
 <tr>
  <th>м.р., ед.ч.</th>
  <td>{м.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>винителен падеж</th>
  <td>{винителен падеж}</td>
 </tr>
 <tr>
  <th>дателен падеж</th>
  <td>{дателен падеж}</td>
 </tr>
 <tr>
  <th>дателен падеж, предложна форма (на&#160;?)</th>
  <td>{дателен падеж, предложна форма}</td>
 </tr>
 <tr>
  <th>ж.р., ед.ч.</th>
  <td>{ж.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>ср.р., ед.ч.</th>
  <td>{ср.р., ед.ч.}</td>
 </tr>
 <tr>
  <th>мн.ч.</th>
  <td>{мн.ч.}</td>
 </tr>
</table>
