<table class="forms-table">
 <tr>
  <th>именителен падеж</th>
  <td>{именителен падеж}</td>
 </tr>
 <tr>
  <th>винителен падеж</th>
  <td>{винителен падеж}</td>
 </tr>
 <tr>
  <th>винителен падеж, кратка форма</th>
  <td>{винителен падеж, кратка форма}</td>
 </tr>
 <tr>
  <th>дателен падеж</th>
  <td>{дателен падеж}</td>
 </tr>
 <tr>
  <th>дателен падеж, предложна форма (на&#160;?)</th>
  <td>{дателен падеж, предложна форма}</td>
 </tr>
 <tr>
  <th>дателен падеж, кратка форма</th>
  <td>{дателен падеж, кратка форма}</td>
 </tr>
</table>
