<?php

class IncorrectFormsGenerator
{

	static private
		$patterns = array(
			array('б$', 'п'),
			array('г$', 'к'),
			array('д$', 'т'),
			array('ж$', 'ш'),
			array('з$', 'с'),
			array('в$', 'ф'),
			array('ост$', 'ос'),
			array('аеро', 'айро'),
			array('зс', 's'),
			array('гръ', 'гър'),
			array('изп', 'исп'),
			array('изк', 'иск'),
			array('изс', 'ис'),
			array('изт', 'ист'),
			array('отт', 'от'),
			array('стн', 'сн'),
			array('сб', 'зб'),
			array('сг', 'зг'),
			array('сф', 'св'),
			array('дк', 'тк'),
			array('дп', 'тп'),
			array('жк', 'шк'),
			array('бт', 'пт'),
			array('вт', 'фт'),
			array('вк', 'фк'),
			array('хв', 'f'),
			array('абс', 'апс'),
			array('подп', 'потп'),
			array('подк', 'потк'),
			array('подс', 'потс'),
			array('подт', 'пот'),
			array('предс', 'прес'),
			array('нн', 'н'),
			array('лиa', 'лija'), // първото е с латинско „a“
			array('лиa', 'лja'), // първото е с латинско „a“
			#array('щ', 'шт'),
			// (unescape) латинско -> кирилско (и ударените се изговарят с „ъ“)
			array('a$', 'а'), // чета -> четъ
		),
		$vowelPatterns = array(
			#array('я', 'y'), // спя -> спъ
			array('ия', 'иа'),
			#array('ия', 'иъ'),
			array('ие$', 'ie'),
			#array('я', 'jа'),
			#array('ю', 'jу'),
			array('а', 'y'),
			array('о', 'u'),
			array('е', 'i'),
			array('ъ', 'a'),
			array('у', 'o'),
			array('и', 'e'),
		);


	static public function getIncorrectForms($word)
	{
		$patterns = self::$patterns;

		if ( strpos($word, '`') !== false ) {
			$eword = self::escapedStressedVowel(self::stressSubwords($word));
			$patterns = array_merge($patterns, self::$vowelPatterns);
		} else {
			$eword = $word;
		}

		$forms = array();
		self::genIncorrectForm($eword, $patterns, $forms);

		$forms = array_unique($forms);
		$forms = self::removeBaseForm($word, $forms);
		$forms = self::clearForms($word, $forms);
		asort($forms);

		return $forms;
	}


	static private function escapedStressedVowel($str)
	{
		return preg_replace('/(.)`/ue', "MyI18nToolkit::cyrlat('$1')", $str);
	}

	static private function clearStressedVowel($str)
	{
		return str_replace('`', '', $str);
	}

	static private function stressSubwords($str)
	{
		return strtr($str, array(
			' се' => ' се`',
			' си' => ' си`',
			' ми' => ' ми`',
		));
	}

	static private function removeBaseForm($base, $forms)
	{
		$base = self::clearStressedVowel($base);
		foreach ($forms as $k => $form) {
			if ($form == $base) {
				unset($forms[$k]);
			}
		}

		return $forms;
	}


	static private function clearForms($base, $forms)
	{
		foreach ($forms as $k => $form) {
			if (self::startsWithI($base) && self::startsWithE($form)) {
				unset($forms[$k]);
			} else if (self::startsWithE($base) && self::startsWithI($form)) {
				unset($forms[$k]);
			} else if (self::endsWithI($base) && self::endsWithE($form)) {
				unset($forms[$k]);
			} else if (self::endsWithE($base) && self::endsWithI($form)) {
				unset($forms[$k]);
			}
		}

		return $forms;
	}


	static public function startsWithI($word)
	{
		return strpos($word, 'и') === 0;
	}

	static public function startsWithE($word)
	{
		return strpos($word, 'е') === 0;
	}

	static public function endsWithI($word)
	{
		return preg_match('/и$/', $word);
	}

	static public function endsWithE($word)
	{
		return preg_match('/е$/', $word);
	}

	static private function genIncorrectForm($form, $patterns, &$box = array())
	{
		if (empty($patterns)) {
			return;
		}

		list($search, $repl) = $patterns[0];

		if ( ! preg_match("/$search/", $form)) {
			array_shift($patterns);
			self::genIncorrectForm($form, $patterns, $box);
			return;
		}

		$iforms = array();
		if ( preg_match('/[$^]/', $search) ) {
			$iforms[] = preg_replace("/$search/", $repl, $form, 1);
		} else {
			$iforms = self::getFormsExponential($form, $search, $repl);
		}

		array_shift($patterns);
		foreach ($iforms as $iform) {
			$box[] = self::normalizeIncorrectForm($iform);
			self::genIncorrectForm($iform, $patterns, $box);
		}
	}

	static private function normalizeIncorrectForm($iform)
	{
		$iform = MyI18nToolkit::latcyr($iform);
		$iform = strtr($iform, array(
			'сс' => 'с',
		));

		return $iform;
	}


	static private function getFormsExponential($base, $old, $new)
	{
		$chunks = explode($old, $base);
		$guys = array($old, $new);
		$forms[] = $chunks[0];
		for ($i = 1; $i < count($chunks); $i++) {
			$nforms = array();
			foreach ($forms as $form) {
				foreach ($guys as $guy) {
					$nforms[] = $form . $guy . $chunks[$i];
				}
			}
			$forms = $nforms;
		}

		return $forms;
	}

}

/*
Уикипедия:Списък_на_правописни_грешки:

абсолутен	абсолютен
абуруген	абориген
адрез	адрес
айран	айрян
айрогара	аерогара
акомолатор	акумулатор
акумолатор	акумулатор
акомулатор	акумулатор
аксесуар	аксесоар
актоално	актуално
амолет	амулет
анцунг	анцуг
апартамен	апартамент
аператив	аперитив
апстрахирам	абстрахирам
аргомент	аргумент
ас	аз
асансиор	асансьор
асансйор	асансьор
асвалт	асфалт
астегматизъм	астигматизъм
атски	адски
ацки	адски
адцки	адски
балха	бълха
Бангладеж	Бангладеш
беберон	биберон
бег	бек
безкруполна	безскрупулна
безледно	безследно
беследно	безследно
безопастност	безопасност
безпорно	безспорно
безмислен	безсмислен
безучасен	безучастен
белешка	бележка
бес	без
беспорно	безспорно
благодария	благодаря
бодалкам	будалкам
боксувам	буксувам
бомбони	бонбони
бомбандирам	бомбардирам
боноси	бонуси
бубина	бобина
буклук	боклук
булонка	болонка
булченски	булчински
бумбе	бомбе
бутка	будка
бърдак	бардак
бъсма	басма
бюджед	бюджет
бяли	бели
вапрос	въпрос
въпроз	въпрос
варви	върви
ваком	вакуум
ваща	вашата
весник	вестник
верно	вярно
ветрина	витрина
взаимствам	заимствам
визш	висш
викъм	викам
вишестоящ	висшестоящ
виш	висш
виш	виж
вище	вижте
воено	военно
волкан	вулкан
впечетление	впечатление
впредвид	предвид
времено	временно
връзник	връстник
възвращаемост	възвръщаемост
въспирам	възпирам
възспирам	възпирам
възоснова на	въз основа на
възтание	въстание
възстание	въстание
генеколог	гинеколог
генитична	генетична
геройте	героите
глетка	гледка
грат	град
грацки	градски
градос	градус
гърк	грък
далбока	дълбока
дарво	дърво
даржава	държава
двойнствен	двойствен
дволичник	двуличник
двуеточие	двоеточие
двуични	двоични
двуцефка	двуцевка
дедектив	детектив
детствен	девствен
девственна	девствена
дественост	девственост
децки	детски
димокрация	демокрация
дигам	вдигам
добар	добър
довут	довод
доло	долу
долър	долар
дондуркам	дундуркам
досък	досег
дохувит	духовит
дразна	дразня
древногръдски	древногръцки
друид	дроид
думати	домати
дуспа	дузпа
дъвчим	дъвчем
дъндания	дандания
едар	едър
еденица	единица
единственно	единствено
единтичен	идентичен
елексир	еликсир
ентелигент	интелигент
ентелегент	интелигент
ентусиас	ентусиаст
ероглиф	йероглиф
еродиран	ерудиран
есено	есенно
ессе	есе
ефтин	евтин
жарак	жарък
жирав	жираф
жилъв	жилав
забършиш	забършеш
загатка	загадка
задгърбвам	загърбвам
замесник	заместник
засложава	заслужава
збием	сбием
зблъсквам	сблъсквам
зборник	сборник
збърка	сбърка
зграда	сграда
згреша	сгреша
зема	взема
игоист	егоист
идеот	идиот
избранник	избраник
изведнъш	изведнъж
извесно	известно
извземам	изземам
издаиднически	издайнически
издаржа	издържа
изкам	искам
изклучение	изключение
изкра	искра
израсвам	израствам
изруд	изрод
изстерия	истерия
изтинал	изстинал
изтина	истина
изтрел	изстрел
изтукан	истукан
имигрант	емигрант
инжинер	инженер
интелегентен	интелигентен
интелегентност	интелигентност
интерестно	интересно
инъче	иначе
исключение	изключение
исконно	изконно
искренно	искрено
испит	изпит
исползвам	използвам
испускам	изпускам
истинал	изстинал
источник	източник
истрел	изстрел
истривам	изтривам
италиянски	италиански
йогорт	йогурт
кадето	където
казъх	казах
какафония	какофония
Калифорниа	Калифорния
калъв	калъф
картовки	картофки
касмет	късмет
книшка	книжка
коефицент	коефициент
колидор	коридор
комир	кумир
комисионна	комисиона
комоникация	комуникация
компроментирам	компрометирам
комфитюр	конфитюр
консомация	консумация
конфортно	комфортно
копувам	купувам
корегирам	коригирам
корпурации	корпорации
косвенно	косвено
косинос	косинус
котия	кутия
кофчег	ковчег
крадът	крадат
кремвирш	кренвирш
кулиба	колиба
кумик	комик
кумин	комин
куплонг	куплунг
куповач	купувач
куфраж	кофраж
куфър	куфар
кървъв	кървав
къртечница	картечница
лажа	лъжа
лакирвам	лакирам
лафка	лавка
лебетка	лебедка
лимонтозу	лимонтузу
линийте	линиите
лисче	листче
лиценс	лиценз
лосче	лостче
лошче	лостче
лотус	лотос
лъвина	лавина
магнитафон	магнетофон
магнитут	магнитуд
макър	макар
маниа	мания
манияк	маниак
маняк	маниак
марморя	мърморя
маршерут	маршрут
марширут	маршрут
материял	материал
матерял	материал
междучастие	междучасие
мекошав	мекушав
месни	местни
милиярд	милиард
милярд	милиард
минъл	минал
мириз	мирис
миродавен	меродавен
мисал	мисъл
младеш	младеж
молиф	молив
мошна	мощна
мощтност	мощност
мутика	мотика
мъркуч	маркуч
мърсотия	мръсотия
натурален	нотариален
надменост	надменност
наименовам	наименувам
наистинна	наистина
найстинна	наистина
натписване	надписване
невироятен	невероятен
неврастеник	невръстеник
немарлив	немърлив
неознаваемост	неузнаваемост
неотдавнъшен	неотдавнашен
нервени	нервни
неска	днеска
несъмненно	несъмнено
неуспорим	неоспорим
неутразим	неотразим
нещасна	нещастна
неястност	неясност
никролог	некролог
ноща	нощта
някаде	някъде
обедително	убедително
обеждения	убеждения
обезомял	обезумял
обесилвам	обезсилвам
обеснявам	обяснявам
обещетение	обезщетение
обикновенно	обикновено
обичтта	обичта
облегчен	облекчен
облицовачни	облицовъчни
облошка	обложка
образувание	образование
обужавам	обожавам
оважавам	уважавам
оведомя	уведомя
овековечавам	увековечавам
овеличавам	увеличавам
овеселителен	увеселителен
овивам	увивам
оговарям	уговорям
одавна	отдавна
одари	удари
одачно	удачно
одяло	одеяло
одеало	одеяло
оеднаквявам	уеднаквявам
озадъчен	озадачен
окраса	украса
окопирам	окупирам
окупавам	окопавам
олимпияда	олимпиада
оличавам	уличавам
омбуцман	омбудсман
омбутсман	омбудсман
онаследявам	унаследявам
опастност	опасност
описаниа	описания
оплашвам	уплашвам
оплътнявам	уплътнявам
оповавам се	уповавам се
оправление	управление
опражнявам	упражнявам
опътвам	упътвам
осигорявам	осигурявам
осмихвам	усмихвам
особенно	особено
оспех	успех
оспивам се	успивам се
оспокоявам	успокоявам
оспявам	успявам
остановена	установена
осъвършенствам	усъвършенствам
осъмнявам се	усъмнявам се
осърдно	усърдно
отатък	оттатък
отварам	отварям
отекчителен	отегчителен
отзова	озова
отностно	относно
отрепвам	утрепвам
оттървах се	отървах се
отъпкан	утъпкан
отъпквам	утъпквам
охажвам	ухажвам
оцелвам	уцелвам
очудвам	учудвам
оште	още
палноценен	пълноценен
панахида	панихида
парви	първи
педерас	педераст
педераз	педераст
пеизаж	пейзаж
переодичен	периодичен
петак	петък
писменност	писменост
писъл	писал
пицерия	пицария
плевмония	пневмония
площа	площта
повиност	повинност
повот	повод
полвин	половин
полужение	положение
полюлей	полиле`й
полюст	полюс
порастнал	пораснал
порногравски	порнографски
портукал	портокал
посланник	посланик
посрешна	посрещна
потчинен	подчинен
праздник	празник
превъплащение	превъплъщение
пребирам	прибирам
предверие	преддверие
предвит	предвид
предвърително	предварително
предрасъдици	предразсъдъци
предтекст	претекст
предценка	преценка
преключва	приключва
прелесна	прелестна
преностен	прено`сен
препядствие	препятствие
прецедател	председател
прещипан	прищипан
приател	приятел
приатно	приятно
приакор	прякор
пришалец	пришълец
продалжава	продължава
прожина	пружина
проспирира	просперира
пръс	пръст
пръставлява	представлява
пръщи	пращи
пумия	помия
пумияр	помияр
пунктоация	пунктуация
пъпеж	пъпеш
първеню	парвеню
пътнишки	пътнически
пясак	пясък
радиятор	радиатор
радятор	радиатор
радиос	радиус
разочерование	разочарование
разорачование	разочарование
разспространявам	разпространявам
разста	раста
разтеж	растеж
разтекал	разтекъл
разтрел	разстрел
растрел	разстрел
разтъкаване	разтакаване
рака	ръка
ранклиста	ранглиста
растна	расна
расхотка	разходка
регестрирам	регистрирам
рекал	рекъл
рожденник	рожденик
ръзстояние	разстояние
ръстеж	растеж
савсем	съвсем
садба	съдба
садържание	съдържание
саздавам	създавам
самoчуствие	самочувствие
сарце	сърце
сащия	същия
сащество	същество
свадба	сватба
свера	сфера
свесно	свястно
свещенна	свещена
свещенно	свещено
сдание	здание
севте	сефте
секи	всеки
сигорно	сигурно
силуз	силоз
синвол	символ
синос	синус
ситоация	ситуация
ситуациа	ситуация
сички	всички
сичко	всичко
скилитка	скилидка
скодоумен	скудоумен
скраб	скрап
скучнувато	скучновато
скътаеш	скатаеш
словообразователен	словообразувателен
случей	случай
смръдлив	смрадлив
собственна	собствена
спесификация	спецификация
специялен	специален
справат	справят
спрът	спрат
сретство	средство
сръвнение	сравнение
сръжавам се	сражавам се
сташ	стаж
страно	странно
структори	структури
ступур	ступор
стълпкновение	стълкновение
сумнамбули	сомнамбули
сомнабули	сомнамбули
сушоар	сешоар
сфетофар	светофар
съжелявам	съжалявам
сажалявам	съжалявам
съкрален	сакрален
съкровенна	съкровена
съкровенно	съкровено
съшност	същност
същественна	съществена
същественно	съществено
съчма	сачма`
сюджет	сюжет
сянки	сенки
тапанар	тъпанар
тваря	товаря
тенесист	тенисист
тетратка	тетрадка
тичаики	тичайки
толкос	толкоз
торбина	турбина
транвай	трамвай
трансцедентен	трансцендентен
трастика	тръстика
туберколоза	туберкулоза
туку-така	току-така
тъка	така
търалеж	таралеж
убективна	обективна
убесвам	обесвам
убида	обида
убичам	обичам
убърна	обърна
удобрявам	одобрявам
удър	удар
ужастно	ужасно
ожастно	ужасно
ожасно	ужасно
ужениш	ожениш
улекна	олекна
уливам	оливам
улигофрен	олигофрен
улях	олях
умраза	омраза
упаковам	опаковам
уписвам	описвам
уплаквам	оплаквам
уплел	оплел
упора	опора
управдал	оправдал
управия	оправия
упровергае	опровергае
упростявам	опростявам
упрощавам	опрощавам
упържа	опържа
уранготан	орангутан
урганизирам	организирам
уръдие	оръдие
уръжие	оръжие
усвежавам	освежавам
усигорявам	осигурявам
услушвам се	ослушвам се
усмелявам	осмелявам
усмислил	осмислил
успорван	оспорван
усран	осран
устаря	остаря
утказвам	отказвам
утрепка	отрепка
утривалка	изтривалка
отривалка	изтривалка
утривам	отривам
учавствам	участвам
учовечавам	очовечавам
фармацефт	фармацевт
фастъци	фъстъци
фелтфебел	фелдфебел
финансии	финанси
финна	фина
финно	фино
фойе	фоайе
фотьоел	фотьойл
фръквам	хвръквам
фтасала	втасала
фтълпявам	втълпявам
халост	халос
халостен	халосен
хаус	хаос
хиликоптер	хеликоптер
Хирушима	Хирошима
хитар	хитър
христианство	християнство
царвул	цървул
цензориран	цензуриран
цено	ценно
цероза	цироза
цъвтеж	цъфтеж
чаршав	чаршаф
челюсна	челюстна
через	чрез
чесно	честно
човал	чувал
чусвам	чувствам
чуствам	чувствам
чъсовник	часовник
шезофрения	шизофрения
шерок	широк
шикаф	шкаф
шкав	шкаф
шофиорски	шофьорски
шпертплат	шперплат
Шугун	Шогун
щаслив	щастлив
штепсел	щепсел
ъгал	ъгъл
ъкъл	акъл
ъпсурт	абсурд
юристконсулт	юрисконсулт
юнуша	юноша
яморлук	ямурлук
яркос	яркост
ярос	ярост
яш	яж
*/
